# Observations
1. It appears the salaries are very high on the high end and very low at the low end.
2. Mimics the business model of a franchise restaurant where most of the lower end employees make minimum wage.

In [61]:
from sqlalchemy import create_engine, Table, Column, MetaData, Integer, Computed
from random import randint
import os
from dotenv import load_dotenv
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from matplotlib import colors
from matplotlib.ticker import PercentFormatter
import scipy.stats as sts

# dialect+driver = 'postgres' for us, host probably = 'localhost' (for now), username defaults to 'postgres'

In [62]:
load_dotenv()
username=os.environ.get('DB_USERNAME')
password=os.environ.get('DB_PASSWORD')

connection_string= f'postgresql+psycopg2://{username}:{password}@localhost:5432/EmployeeDB'

In [63]:
def doQuery(query): # READ
    return connection.execute(query).fetchall()
def doUpdate(updateQuery): # CREATE, UPDATE, DELETE
    connection.execute(updateQuery)

In [64]:
connection = create_engine(connection_string).connect()

query = "select e.emp_no, e.emp_title_id, e.birthdate, e.first_name, e.last_name, e.sex, e.hire_date, t.title, s.salary \
from employee e, salary s, title t \
where e.emp_no = s.emp_no and \
e.emp_title_id = t.title_id"

queryResults = doQuery(query)
queryResults_df = pd.DataFrame(queryResults)

connection.close()
queryResults_df = queryResults_df.rename(columns={0:'Emp Number', 1:'Title ID', 2:'Birth Date',3:'First Name',4:'Last Name',5:'Gender',6:'Hire Date',7:'Title',8:'Salary'})
queryResults_df.head()

,Emp Number,Title ID,Birth Date,First Name,Last Name,Gender,Hire Date,Title,Salary
0,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,Staff,87084
1,67799,e0002,1961-10-17,Pantung,Cools,M,1994-01-28,Engineer,48111
2,299898,s0001,1964-02-15,Munehiko,Janocha,M,1988-12-11,Staff,63315
3,492723,e0003,1959-09-30,Piyawadee,Sanella,M,1987-07-11,Senior Engineer,46740
4,411614,e0003,1958-03-29,Martins,Wynblatt,M,1992-02-15,Senior Engineer,54770

Create a histogram to visualize the most common salary ranges for employees.

In [75]:
salary=queryResults_df["Salary"]
plt.hist(salary)
plt.show()
plt.savefig("../Images/SalaryHistogram.png")
print(sts.normaltest(salary.sample(50)))

NormaltestResult(statistic=3.176316228300991, pvalue=0.20430156555854617)

In [72]:
# Demonstrate calculating measures of central tendency
mean_numpy = np.mean(salary)
print(f"The mean salary is {mean_numpy}")

median_numpy = np.median(salary)
print(f"The median salary is {median_numpy}")

mode_scipy = sts.mode(salary)
print(f"The mode salary is {mode_scipy}")

The mean salary is 52970.732451403885
The median salary is 48681.0
The mode salary is ModeResult(mode=array([40000], dtype=int64), count=array([95346]))

Create a bar chart of average salary by title.

In [73]:
connection = create_engine(connection_string).connect()

query = "select round(avg(s.salary)), t.title \
from employee e, salary s, title t \
where s.emp_no = e.emp_no and \
e.emp_title_id = t.title_id \
group by t.title"

queryResults2 = doQuery(query)
queryResults2_df = pd.DataFrame(queryResults2)

connection.close()
queryResults2_df = queryResults2_df.rename(columns={0:'Average Salary', 1:'Title'})
queryResults2_df

  Average Salary               Title
0          48564  Assistant Engineer
1          48535            Engineer
2          51531             Manager
3          48507     Senior Engineer
4          58550        Senior Staff
5          58465               Staff
6          48583    Technique Leader

In [74]:
# Create a bar chart based upon the above data

average_salary=queryResults2_df['Average Salary']
x_axis = np.arange(len(average_salary))
plt.bar(x_axis, average_salary, color="b", align="center")
# Create the ticks for our bar chart's x axis
tick_locations = [value for value in x_axis]
plt.xticks(tick_locations, queryResults2_df['Title'], rotation=45)
# Create the ticks for our bar chart's x axis
tick_locations = [value for value in x_axis]
plt.xticks(tick_locations, queryResults2_df['Title'], rotation=45)
# Set the limits of the x axis
plt.xlim(-0.75, len(x_axis)-0.25)
plt.ylim(0, max(average_salary)+10000)
# Give the chart a title, x label, and y label
plt.title("Average Salary by Title")
plt.xlabel("Titles")
plt.ylabel("Average Salary")
plt.savefig("../Images/AverageSalaryByTitle.png")
plt.show()